In [15]:
import pandas as pd

In [16]:
pd.Series([10, 8, 3, 4, 5])

0    10
1     8
2     3
3     4
4     5
dtype: int64

In [17]:
type(pd.Series([10, 8, 3, 4, 5]))

pandas.core.series.Series

In [18]:
seri = pd.Series([10, 8, 3, 4, 5])

In [19]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [20]:
seri.values

array([10,  8,  3,  4,  5], dtype=int64)

In [21]:
seri.tail()

0    10
1     8
2     3
3     4
4     5
dtype: int64

In [22]:
import numpy as np

In [23]:
a = np.array([1, 2, 3, 4, 5])
seri = pd.Series(a)
seri

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [24]:
seri[0]

1

In [25]:
seri[0:3]

0    1
1    2
2    3
dtype: int32

In [27]:
seri = pd.Series([121, 200, 150, 99], index=["reg", "loj", "cart", "rf"])
seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [28]:
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [29]:
seri.keys()

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [30]:
list(seri.items())

[('reg', 121), ('loj', 200), ('cart', 150), ('rf', 99)]

In [31]:
seri.values

array([121, 200, 150,  99], dtype=int64)

In [32]:
"reg" in seri

True

In [33]:
seri["reg"]

121

In [35]:
seri[["rf", "reg"]]

rf      99
reg    121
dtype: int64

In [36]:
l = [1, 2, 39, 67, 90]
l

[1, 2, 39, 67, 90]

In [37]:
pd.DataFrame(l, columns=["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             39
3             67
4             90

In [41]:
pd.DataFrame(l, columns=["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             39
3             67
4             90

In [47]:
m = np.arange(1, 10).reshape((3, 3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [48]:
pd.DataFrame(m, columns=["var1", "var2", "var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [49]:
df = pd.DataFrame(m, columns=["var1", "var2", "var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [52]:
df.columns = ("deg1", "", "")

In [53]:
df.columns

Index(['deg1', '', ''], dtype='object')

In [54]:
df.axes

[RangeIndex(start=0, stop=3, step=1), Index(['deg1', '', ''], dtype='object')]

In [55]:
df.shape

(3, 3)

In [56]:
df.ndim

2

In [57]:
df.size

9

In [58]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [59]:
s1 = np.random.randint(10, size=5)
s2 = np.random.randint(10, size=5)
s3 = np.random.randint(10, size=5)

In [60]:
sozluk = {"var1": s1, "var2": s2, "var3": s3}

In [61]:
sozluk

{'var1': array([5, 2, 5, 8, 9]),
 'var2': array([0, 3, 6, 3, 5]),
 'var3': array([9, 4, 8, 7, 0])}

In [63]:
df = pd.DataFrame(sozluk)

In [64]:
df

   var1  var2  var3
0     5     0     9
1     2     3     4
2     5     6     8
3     8     3     7
4     9     5     0

In [65]:
df[0:1]

   var1  var2  var3
0     5     0     9

In [66]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [69]:
df[0:6]

   var1  var2  var3
0     5     0     9
1     2     3     4
2     5     6     8
3     8     3     7
4     9     5     0

In [70]:
df.drop(0, axis=0)

   var1  var2  var3
1     2     3     4
2     5     6     8
3     8     3     7
4     9     5     0

In [72]:
df.drop(0, axis=0, inplace=True)

In [73]:
df

   var1  var2  var3
1     2     3     4
2     5     6     8
3     8     3     7
4     9     5     0

In [77]:
l = [2, 3]

In [79]:
df.drop(l, axis=0)

   var1  var2  var3
1     2     3     4
4     9     5     0

In [83]:
df.index

RangeIndex(start=1, stop=5, step=1)

In [86]:
df.index = ["a", "b", "c", "d"]
df

   var1  var2  var3
a     2     3     4
b     5     6     8
c     8     3     7
d     9     5     0

In [87]:
"var1" in df

True

In [88]:
l = ["var1", "var4", "var2"]

In [91]:
for i in l:
    print(i in df)

True
False
True

In [92]:
df

   var1  var2  var3
a     2     3     4
b     5     6     8
c     8     3     7
d     9     5     0

In [95]:
df["var1"]

a    2
b    5
c    8
d    9
Name: var1, dtype: int32

In [97]:
df["var4"] = df["var1"] / df["var2"]
df

   var1  var2  var3      var4
a     2     3     4  0.666667
b     5     6     8  0.833333
c     8     3     7  2.666667
d     9     5     0  1.800000

In [99]:
df.drop("var4", axis=1)

   var1  var2  var3
a     2     3     4
b     5     6     8
c     8     3     7
d     9     5     0

In [101]:
df.drop("var4", axis=1, inplace=True)

In [102]:
df

   var1  var2  var3
a     2     3     4
b     5     6     8
c     8     3     7
d     9     5     0

In [105]:
m = np.random.randint(1, 30, size=(10, 3))
df = pd.DataFrame(m, columns=["var1", "var2", "var3"])
df

   var1  var2  var3
0     8    13     8
1     7    13    21
2    20    18    13
3    19    13    29
4     3    23    20
5    18     2    28
6    26    24     2
7    21     1    11
8    22    27     6
9    12     7     3

In [ ]:
# loc: tanımlandığı şekli ile seçim yapmak için kullanılır.

In [110]:
df.loc[0:3]

   var1  var2  var3
0     8    13     8
1     7    13    21
2    20    18    13
3    19    13    29

In [ ]:
# iloc: alışık olduğumuz indeksleme mantığı ile seçim yapar.

In [112]:
df.iloc[0:3]

   var1  var2  var3
0     8    13     8
1     7    13    21
2    20    18    13

In [113]:
df

   var1  var2  var3
0     8    13     8
1     7    13    21
2    20    18    13
3    19    13    29
4     3    23    20
5    18     2    28
6    26    24     2
7    21     1    11
8    22    27     6
9    12     7     3

In [114]:
df["var1"][0:1]

0    8
Name: var1, dtype: int32

In [115]:
df[0:2][["var1", "var2"]]

   var1  var2
0     8    13
1     7    13

In [116]:
df

   var1  var2  var3
0     8    13     8
1     7    13    21
2    20    18    13
3    19    13    29
4     3    23    20
5    18     2    28
6    26    24     2
7    21     1    11
8    22    27     6
9    12     7     3

In [118]:
df[df.var1 > 15]

   var1  var2  var3
2    20    18    13
3    19    13    29
5    18     2    28
6    26    24     2
7    21     1    11
8    22    27     6

In [119]:
df[df.var1 > 15]["var1"]

2    20
3    19
5    18
6    26
7    21
8    22
Name: var1, dtype: int32

In [121]:
df[(df.var1 > 15) & (df.var3 < 5)]

   var1  var2  var3
6    26    24     2

In [122]:
df

   var1  var2  var3
0     8    13     8
1     7    13    21
2    20    18    13
3    19    13    29
4     3    23    20
5    18     2    28
6    26    24     2
7    21     1    11
8    22    27     6
9    12     7     3

In [124]:
m = np.random.randint(1, 30, size=(5, 3))
df = pd.DataFrame(m, columns=["var1", "var2", "var3"])
df

   var1  var2  var3
0    13    22    18
1     7    19    15
2    28    29    11
3    16    28    29
4     4     5    12

In [125]:
m = np.random.randint(1, 30, size=(5, 3))
df1 = pd.DataFrame(m, columns=["var1", "var2", "var3"])
df1

   var1  var2  var3
0     5    18    14
1    29     6    14
2    26     2    29
3    24     2    19
4    10    24    17

In [126]:
df1 = df + 99

In [127]:
df1

   var1  var2  var3
0   112   121   117
1   106   118   114
2   127   128   110
3   115   127   128
4   103   104   111

In [129]:
pd.concat([df, df1])

   var1  var2  var3
0    13    22    18
1     7    19    15
2    28    29    11
3    16    28    29
4     4     5    12
0   112   121   117
1   106   118   114
2   127   128   110
3   115   127   128
4   103   104   111

In [130]:
pd.concat([df, df1], ignore_index=True)

   var1  var2  var3
0    13    22    18
1     7    19    15
2    28    29    11
3    16    28    29
4     4     5    12
5   112   121   117
6   106   118   114
7   127   128   110
8   115   127   128
9   103   104   111

In [131]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [132]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [134]:
df1.columns = ["var1", "var2", "deg3"]
df1

   var1  var2  deg3
0   112   121   117
1   106   118   114
2   127   128   110
3   115   127   128
4   103   104   111

In [135]:
pd.concat([df, df1])

   var1  var2  var3   deg3
0    13    22  18.0    NaN
1     7    19  15.0    NaN
2    28    29  11.0    NaN
3    16    28  29.0    NaN
4     4     5  12.0    NaN
0   112   121   NaN  117.0
1   106   118   NaN  114.0
2   127   128   NaN  110.0
3   115   127   NaN  128.0
4   103   104   NaN  111.0

In [136]:
pd.concat([df, df1], join="inner")

   var1  var2
0    13    22
1     7    19
2    28    29
3    16    28
4     4     5
0   112   121
1   106   118
2   127   128
3   115   127
4   103   104

In [139]:
df1 = pd.DataFrame({"Calisanlar": ["Ali", "Veli", "Ayse", "Fatma"],
                    "grup": ["Muhasebe", "Muhendislik", "Muhendislik", "Ik"]})
df1

  Calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           Ik

In [140]:
df2 = pd.DataFrame({"Calisanlar": ["Ali", "Veli", "Ayse", "Fatma"],
                    "ilk_giris": [2010, 2008, 2014, 2019]})
df2

  Calisanlar  ilk_giris
0        Ali       2010
1       Veli       2008
2       Ayse       2014
3      Fatma       2019

In [141]:
pd.merge(df1, df2)

  Calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2008
2       Ayse  Muhendislik       2014
3      Fatma           Ik       2019

In [143]:
pd.merge(df1, df2, on="Calisanlar")

  Calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2008
2       Ayse  Muhendislik       2014
3      Fatma           Ik       2019

In [144]:
df3 = pd.merge(df1, df2)
df3

  Calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2008
2       Ayse  Muhendislik       2014
3      Fatma           Ik       2019

In [146]:
df4 = pd.DataFrame({"grup": ["Muhasebe", "Muhendislik", "Ik"],
                    "mudur": ["Caner", "Mustafa", "Berkcan"]})
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           Ik  Berkcan

In [147]:
pd.merge(df3, df4, on="grup")

  Calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2010    Caner
1       Veli  Muhendislik       2008  Mustafa
2       Ayse  Muhendislik       2014  Mustafa
3      Fatma           Ik       2019  Berkcan

In [148]:
df5 = pd.DataFrame({"grup": ["Muhasebe", "Muhasebe", "Muhendislik", "Muhendislik", "Ik", "Ik"],
                    "yetenekler": ["matematik", "excel", "kodlama", "linux", "excel", "yonetim"]})
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           Ik      excel
5           Ik    yonetim

In [149]:
df1

  Calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           Ik

In [150]:
pd.merge(df1, df5)

  Calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux
6      Fatma           Ik      excel
7      Fatma           Ik    yonetim

In [152]:
import seaborn as sns

In [156]:
df = sns.load_dataset("planets")

In [158]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [159]:
df.shape

(1035, 6)

In [162]:
df["mass"].mean()

2.6381605847953216

In [163]:
df["mass"].count()

513

In [167]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [169]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

In [171]:
df = pd.DataFrame({"gruplar": ["A", "B", "C", "A", "B", "C"],
                   "veri": [10, 11, 52, 23, 43, 55]}, columns=["gruplar", "veri"])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [172]:
df.groupby("gruplar")

In [173]:
df.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [174]:
df.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

In [175]:
df = sns.load_dataset("planets")
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [176]:
df.groupby("method")

In [177]:
df.groupby("method")["orbital_period"]

In [180]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

In [184]:
df1 = df.groupby("method")["orbital_period"].describe()
df1["mean"].sum()

136222.1041335456

In [191]:
df = pd.DataFrame({"gruplar": ["A", "B", "C", "A", "B", "C"],
                   "degisken1": [10, 23, 33, 22, 11, 99],
                   "degisken2": [100, 253, 333, 262, 111, 969]}, columns=["gruplar", "degisken1", "degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [193]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

In [194]:
df.groupby("gruplar").aggregate(["min", np.median, max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   16.0  22       100  181.0  262
B              11   17.0  23       111  182.0  253
C              33   66.0  99       333  651.0  969

In [195]:
df.groupby("gruplar").aggregate({"degisken1": "min", "degisken2": "max"})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

In [196]:
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [197]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [198]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [1]:
import pandas as pd

df = pd.DataFrame({"gruplar": ["A", "B", "C", "A", "B", "C"],
                   "degisken1": [10, 23, 33, 22, 11, 99],
                   "degisken2": [100, 253, 333, 262, 111, 969]}, columns=["gruplar", "degisken1", "degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [3]:
df["degisken1"] * 9
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [10]:
df_a = df.iloc[:, 1:3]

In [12]:
df_a.transform(lambda x: x - (x.mean()) / x.std())

   degisken1   degisken2
0   9.013055   98.951261
1  22.013055  251.951261
2  32.013055  331.951261
3  21.013055  260.951261
4  10.013055  109.951261
5  98.013055  967.951261

In [15]:
import numpy as np

df.apply(np.sum)

gruplar      ABCABC
degisken1       198
degisken2      2028
dtype: object

In [16]:
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [17]:
import seaborn as sns

titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [18]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [19]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [21]:
titanic.groupby(["sex", "class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [23]:
titanic.pivot_table("survived", index="sex", columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [26]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [28]:
age = pd.cut(titanic["age"], [0, 18, 90])
age.head()

0    (18, 90]
1    (18, 90]
2    (18, 90]
3    (18, 90]
4    (18, 90]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 90]]

In [29]:
titanic.pivot_table("survived", ["sex", age], "class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

In [33]:
pd.read_csv("data/ornekcsv.csv", sep=";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [38]:
pd.read_csv("data/duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [40]:
pd.read_excel("data/ornekx.xlsx")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0